recipes/cantonese-creamed-corn.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cantonese Creamed Corn with Tofu and Rice (Sook Mei Faan)</title>
<meta name="author" content="James" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content" class="content">
<h1 class="title">Cantonese Creamed Corn with Tofu and Rice (Sook Mei Faan)</h1>
<div id="outline-container-orga039556" class="outline-2">
<h2 id="orga039556">Ingredients</h2>
<div class="outline-text-2" id="text-orga039556">
<ul class="org-ul">
<li>1 cups corn kernels</li>
<li>1 can of creamed corn</li>
<li>1 tbsp neutral oil</li>
<li>1 piece ginger</li>
<li>1 clove garlic</li>
<li>2 scallions</li>
<li>1 1/2 cups vegetable stock</li>
<li>Salt</li>
<li>White pepper</li>
<li>2 tsp cornstarch mixed w/ 2 tbsp water</li>
<li>Steamed rice for serving</li>
<li>Silken tofu for serving</li>
<li>Corriander and chili oil for garnish</li>
</ul>
</div>
</div>
<div id="outline-container-orgaf75577" class="outline-2">
<h2 id="orgaf75577">Instructions</h2>
<div class="outline-text-2" id="text-orgaf75577">
<ol class="org-ol">
<li>Heat a medium sauspan and cook ginger, garlic, scallion until aromatic</li>
<li>Add the corn, stock and season with salt and white pepper. Cook for 2-3 minutes to bring to a boil</li>
<li>Stirring constantly add the cornstarch slurry and cook for a further 2-3 minutes until slightly thickened</li>
<li>Serve over rice and tofu and garnish</li>
</ol>
</div>
</div>
</div>
</body>
</html>
